app/views/pages/stats.erb

SELECT  "page_views".* FROM "page_views" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 10]]
SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d 00:00:00 UTC', created_at) AS strftime_y_m_d_00_00_00_utc_created_at FROM "page_views" WHERE (created_at >= '2018-02-28 22:00:00') AND (created_at IS NOT NULL) GROUP BY strftime('%Y-%m-%d 00:00:00 UTC', created_at)
---
                            <i class="fa fa-eye"></i>
                            <%= PageView.count %>

SELECT COUNT(*) AS count_all, "page_views"."ip" AS page_views_ip FROM "page_views" GROUP BY "page_views"."ip"
---
                            <i class="fa fa-user"></i>
                            <%= PageView.group(:ip).count.count %>

SELECT "inquiries".* FROM "inquiries" ORDER BY created_at DESC
SELECT COUNT(*) FROM "inquiries"
---
                            <i class="fa fa-user"></i>
                            <%= Inquiry.count %>