app/controllers/pages_controller.rb

INSERT INTO "page_views" ("page", "ip", "referer", "user_agent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def index
    PageView.create(:page => "Index" , :ip => request.remote_ip , :referer => request.referer , :user_agent => request.user_agent)

INSERT INTO "inquiries" ("name", "email", "phone_no", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def inquiry
    Inquiry.create(:name => params[:name] ,  :email => params[:email] , :phone_no => params[:phone] , :message => params[:message])

INSERT INTO "page_views" ("page", "ip", "referer", "user_agent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def crm
    PageView.create(:page => "CRM" , :ip => request.remote_ip , :referer => request.referer , :user_agent => request.user_agent)

INSERT INTO "page_views" ("page", "ip", "referer", "user_agent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def tradingmachine
    PageView.create(:page => "Trading Machine" , :ip => request.remote_ip , :referer => request.referer , :user_agent => request.user_agent)

INSERT INTO "page_views" ("page", "ip", "referer", "user_agent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def archive
    PageView.create(:page => "Trading Archive" , :ip => request.remote_ip , :referer => request.referer , :user_agent => request.user_agent)

INSERT INTO "page_views" ("page", "ip", "referer", "user_agent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def api_tase_bridge
    PageView.create(:page => "api_tase_bridge" , :ip => request.remote_ip , :referer => request.referer , :user_agent => request.user_agent)

INSERT INTO "page_views" ("page", "ip", "referer", "user_agent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def api_ib_bridge
    PageView.create(:page => "api_ib_bridge" , :ip => request.remote_ip , :referer => request.referer , :user_agent => request.user_agent)

INSERT INTO "page_views" ("page", "ip", "referer", "user_agent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def backoffice
    PageView.create(:page => "BackOffice" , :ip => request.remote_ip , :referer => request.referer , :user_agent => request.user_agent)

INSERT INTO "page_views" ("page", "ip", "user_agent", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def privacy
    PageView.create(:page => "Privacy" , :ip => request.remote_ip , :referer => request.referer , :user_agent => request.user_agent)